Revit 2027 API
FabricationNetworkChangeService.ChangeSize Method
 Changes the size of the selection of fabrication parts.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationNetworkChangeServiceResult ChangeSize(
	ISet<ElementId> selection,
	ISet<FabricationPartSizeMap> fabricationPartSizeMaps
)
Public Function ChangeSize (
	selection As ISet(Of ElementId),
	fabricationPartSizeMaps As ISet(Of FabricationPartSizeMap)
) As FabricationNetworkChangeServiceResult
public:
FabricationNetworkChangeServiceResult ChangeSize(
	ISet<ElementId^>^ selection,
	ISet<FabricationPartSizeMap^>^ fabricationPartSizeMaps
)
member ChangeSize :
        selection : ISet<ElementId> *
        fabricationPartSizeMaps : ISet<FabricationPartSizeMap> -> FabricationNetworkChangeServiceResult
Parameters
selection ISet<ElementId>
 The set of element identifiers of fabrication parts to change the size for.
fabricationPartSizeMaps ISet<FabricationPartSizeMap>
 The map containing the original sizes for the straights to the new sizes.
Return Value
FabricationNetworkChangeServiceResult
Exceptions
Exception | Condition
ArgumentException |  The selection contains invalid elements to change. -or- The fabrication size map is empty.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  No fabrication configuration is loaded.
Remarks
 After this method has been invoked, call:
GetStraightsThatWereNotChanged() to get a set of fabrication part straight element identifiers that were not changed.
GetElementsThatFailed() to get a set of fabrication part element identifiers that had failures.
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace